tap 'homebrew/cask-fonts'

# Pre-requisites
brew 'git'
brew 'watch'
brew 'stow'

### Mac App Store CLI
brew 'mas'

# Programming Languages
brew 'node'
brew 'python'
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
brew 'rust'
brew 'openjdk'

# DevOps
brew 'docker'

# Development Utils
brew 'gh'

# Desktop Applications
cask 'spotify'
cask 'vlc'
cask '1password'
cask 'rectangle' # Mac window manager app
cask 'visual-studio-code' # IDE app
cask 'warp' # terminal app
cask 'notion' # documentation app
mas 'Flow', id: 1423210932

# Browsers
cask 'arc'
# cask 'chromium'
# cask 'firefox'

# MacOS mods
cask 'stats'

